In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'string_col':['1','2','3','4'],
       'int_float':[1,2,1.4,4.6],
       'mix_col':['a','-2',3,4],
       'missing':[1,2,3,np.nan],
       'money':['$12000','$3,34,098','$453.62','$1,198.00']}
data

{'string_col': ['1', '2', '3', '4'],
 'int_float': [1, 2, 1.4, 4.6],
 'mix_col': ['a', '-2', 3, 4],
 'missing': [1, 2, 3, nan],
 'money': ['$12000', '$3,34,098', '$453.62', '$1,198.00']}

In [3]:
df = pd.DataFrame(data=data)
df1 =pd.DataFrame(data=data)

In [4]:
df.head()

  string_col  int_float mix_col  missing      money
0          1        1.0       a      1.0     $12000
1          2        2.0      -2      2.0  $3,34,098
2          3        1.4       3      3.0    $453.62
3          4        4.6       4      NaN  $1,198.00

In [5]:
df.dtypes

string_col     object
int_float     float64
mix_col        object
missing       float64
money          object
dtype: object

In [6]:
df['string_col']=df['string_col'].astype(int)

In [7]:
df.dtypes

string_col      int32
int_float     float64
mix_col        object
missing       float64
money          object
dtype: object

In [8]:
df['int_float']=df['int_float'].astype(int)

In [9]:
df.dtypes
df

   string_col  int_float mix_col  missing      money
0           1          1       a      1.0     $12000
1           2          2      -2      2.0  $3,34,098
2           3          1       3      3.0    $453.62
3           4          4       4      NaN  $1,198.00

In [10]:
df['int_float']=df['int_float'].round(0).astype(int)

In [11]:
df

   string_col  int_float mix_col  missing      money
0           1          1       a      1.0     $12000
1           2          2      -2      2.0  $3,34,098
2           3          1       3      3.0    $453.62
3           4          4       4      NaN  $1,198.00

In [12]:
df.dtypes

string_col      int32
int_float       int32
mix_col        object
missing       float64
money          object
dtype: object

In [26]:
df['mix_col'] = pd.to_numeric(df['mix_col'],errors='coerce')#errors='coerce' if a row value has error so it covert that value to nan
df['mix_col'].dtypes
df['mix_col']

0    NaN
1   -2.0
2    3.0
3    4.0
Name: mix_col, dtype: float64

In [29]:
df['mix_col'] = pd.to_numeric(df['mix_col'],errors='coerce').astype('Int64')
#the above line 1st goes into row convert the string value to nan then change the dtate type to int ix_col'].dtypes
df['mix_col']

0    NaN
1     -2
2      3
3      4
Name: mix_col, dtype: Int64

In [30]:
df['mix_col'] = pd.to_numeric(df['mix_col'],errors='coerce').fillna(0).astype('Int64')
#the above line 1st goes into row convert the string value to nan then change  none with a particular number and then changevdtpyethe dtate type to int ix_col'].dtypes
df['mix_col']

0     0
1    -2
2     3
3     4
Name: mix_col, dtype: Int64

In [32]:
df['missing'] = pd.to_numeric(df['missing'],errors='coerce').fillna(0).astype('Int64')
#the above line 1st goes into row convert the string value to nan then change  none with a particular number and then changevdtpyethe dtate type to int ix_col'].dtypes
df['missing']

0    1
1    2
2    3
3    0
Name: missing, dtype: Int64

In [39]:
df['money_replace'] =df['money'].str.replace('$','').str.replace(',','') 
df['money_replace'] = pd.to_numeric(df['money_replace'])
df['money_replace']

0     12000.00
1    334098.00
2       453.62
3      1198.00
Name: money_replace, dtype: float64

In [40]:
df['money_reger'] =df['money'].str.replace('[\$\,]','',regex=True) 
df['money_reger'] = pd.to_numeric(df['money_reger'])
df['money_reger']

0     12000.00
1    334098.00
2       453.62
3      1198.00
Name: money_reger, dtype: float64

In [42]:
df['money_reger'] = df['money'].str.replace('[\$\,]','',regex=True) 
df['money_reger'] = pd.to_numeric(df['money_reger']).astype(int)

In [43]:
df

,string_col,int_float,mix_col,missing,money,money_replace,money_reger
0,1,1,0,1,$12000,12000.00,12000
1,2,2,-2,2,"$3,34,098",334098.00,334098
2,3,1,3,3,$453.62,453.62,453
3,4,4,4,0,"$1,198.00",1198.00,1198

In [48]:
df.drop(['money','money_replace'],axis=1,inplace=True)

In [49]:
df

   string_col  int_float  mix_col  missing  money_reger
0           1          1        0        1        12000
1           2          2       -2        2       334098
2           3          1        3        3          453
3           4          4        4        0         1198

In [15]:
df1.head()

  string_col  int_float mix_col  missing      money
0          1        1.0       a      1.0     $12000
1          2        2.0      -2      2.0  $3,34,098
2          3        1.4       3      3.0    $453.62
3          4        4.6       4      NaN  $1,198.00

In [17]:
df1['string_col'] = pd.to_numeric(df1['string_col'])
df1['string_col'].dtypes

dtype('int64')

In [19]:
df1['int_float'] = pd.to_numeric(df1['int_float'].round(0),downcast='integer')
df1['string_col'].dtypes

dtype('int64')

In [20]:
df1['int_float'].round(0)

0    1
1    2
2    1
3    5
Name: int_float, dtype: int8